#=======Cloud Seeding=======
unseed <- c(1202.6, 830.1, 372.4, 345.5, 321.2, 244.3, 163.0, 
            147.8, 95.0, 87.0, 81.2, 68.5, 47.3, 41.1, 36.6, 
            29.0, 28.6, 26.3, 26.0, 24.4, 21.4, 17.3, 11.5, 4.9, 4.9, 1.0)
seed <- c(2745.6, 1697.1, 1656.4, 978.0, 703.4, 489.1, 430.0, 
          334.1, 302.8, 274.7, 274.7, 255.0, 242.5, 200.7, 198.6, 
          129.6, 119.0, 118.3, 115.3, 92.4, 40.6, 32.7, 31.4, 17.5, 7.7, 4.1)
Rainfall <- data.frame(unseed,seed)

#=======1.1======
boxplot(Rainfall, ylab = 'Rainfall')
#======从图上可以看出，Unseeded Days中降水量整体偏小，降水量离散程度小
#======Seeded Days中降水量整体有所升高，四分位间距较开，数据离散程度大


#=======1.2=====
t.test(unseed, seed)
